//
// Global includes
//
#include "cbmrincludes.h"

//
// Local includes
//
#include "ramdisk.h"
#include "file.h"
#include "gpt.h"
#include "error.h"

#ifndef UEFI_BUILD_SYSTEM
#pragma prefast(push)
#pragma prefast(disable : 6101, \
                "False positive - _Out_ parameter is always initialized upon success")
#endif

//
// Constants/Macros
//

#define OEMTEXT            "MSDOS5.0"
#define OEMTEXT_LENGTH     8
#define VOLUMELABEL        "STUBOS"
#define VOLUMELABEL_LENGTH 6
#define TWO_MEGABYTES      (2 * 1024 * 1024)

static EFI_GUID RamdiskDiskGuid =
    {0x7c7c7fda, 0x200e, 0x4074, 0x93, 0x8f, 0xc4, 0x00, 0xbd, 0x26, 0x67, 0xc3};
static EFI_GUID RamdiskPartitionEntryGuid =
    {0x1fac5d39, 0xfea3, 0x4669, 0xa9, 0x7c, 0x31, 0x37, 0x68, 0xd1, 0xd7, 0x2a};

//
// Structs
//
typedef struct _RAMDISK_CONTEXT {
    BOOLEAN Initialized;

    // Ramdisk info
    EFI_PHYSICAL_ADDRESS Buffer;
    UINTN BufferSize;
    UINT32 SectorSize;

    // Physical memory
    UINTN NumPages;
    EFI_PHYSICAL_ADDRESS BaseAddress;
    EFI_PHYSICAL_ADDRESS BaseAddress2MBAligned;

    // Registration info
    BOOLEAN Registered;
    EFI_DEVICE_PATH_PROTOCOL* DevicePath;
    CHAR16* DevicePathString;

    // Simple File System
    EFI_DEVICE_PATH_PROTOCOL* SfsDevicePath;
    EFI_FILE_PROTOCOL* SystemVolume;

    // Loaded info
    BOOLEAN Loaded;
    EFI_DEVICE_PATH_PROTOCOL* RamdiskAndFilePathDevicePath;
} RAMDISK_CONTEXT, *PRAMDISK_CONTEXT;

typedef enum {
    ATTR_READ_ONLY = 0x01,
    ATTR_HIDDEN = 0x02,
    ATTR_SYSTEM = 0x04,
    ATTR_VOLUME_ID = 0x08,
    ATTR_DIRECTORY = 0x10,
    ATTR_LONG_NAME = 0x0F // ATTR_READ_ONLY | ATTR_HIDDEN |  ATTR_SYSTEM | ATTR_VOLUME_ID
} DIR_ATTR;

#pragma pack(push, 1)
typedef struct _PACKED_BIOS_PARAMETER_BLOCK_EX {
    UINT16 BytesPerSector;        // offset = 0x000  0
    UINT8 SectorsPerCluster;      // offset = 0x002  2
    UINT16 ReservedSectors;       // offset = 0x003  3
    UINT8 Fats;                   // offset = 0x005  5
    UINT16 RootEntries;           // offset = 0x006  6
    UINT16 Sectors;               // offset = 0x008  8
    UINT8 Media;                  // offset = 0x00A 10
    UINT16 SectorsPerFat;         // offset = 0x00B 11
    UINT16 SectorsPerTrack;       // offset = 0x00D 13
    UINT16 Heads;                 // offset = 0x00F 15
    UINT32 HiddenSectors;         // offset = 0x011 17
    UINT32 LargeSectors;          // offset = 0x015 21
    UINT32 LargeSectorsPerFat;    // offset = 0x019 25
    UINT16 ExtendedFlags;         // offset = 0x01D 29
    UINT16 FsVersion;             // offset = 0x01F 31
    UINT32 RootDirFirstCluster;   // offset = 0x021 33
    UINT16 FsInfoSector;          // offset = 0x025 37
    UINT16 BackupBootSector;      // offset = 0x027 39
    UINT8 Reserved[12];           // offset = 0x029 41
} PACKED_BIOS_PARAMETER_BLOCK_EX; // sizeof = 0x035 53

typedef struct _PACKED_BOOT_SECTOR_EX {
    UINT8 Jump[3];                            // offset = 0x000   0
    CHAR8 Oem[8];                             // offset = 0x003   3
    PACKED_BIOS_PARAMETER_BLOCK_EX PackedBpb; // offset = 0x00B  11
    UINT8 PhysicalDriveNumber;                // offset = 0x040  64
    UINT8 CurrentHead;                        // offset = 0x041  65
    UINT8 Signature;                          // offset = 0x042  66
    UINT32 Id;                                // offset = 0x043  67
    CHAR8 VolumeLabel[11];                    // offset = 0x047  71
    CHAR8 SystemId[8];                        // offset = 0x058  88
} PACKED_BOOT_SECTOR_EX;                      // sizeof = 0x060  96

typedef PACKED_BOOT_SECTOR_EX* PPACKED_BOOT_SECTOR_EX;

typedef struct {
    DWORD dLeadSig;       // 0x41615252
    BYTE sReserved1[480]; // zeros
    DWORD dStrucSig;      // 0x61417272
    DWORD dFree_Count;    // 0xFFFFFFFF
    DWORD dNxt_Free;      // 0xFFFFFFFF
    BYTE sReserved2[12];  // zeros
    DWORD dTrailSig;      // 0xAA550000
} FAT_FSINFO;

typedef struct {
    BYTE Name[11];
    BYTE Attr;
    BYTE NTRes;
    BYTE CrtTimeTenth;
    WORD CrtTime;
    WORD CrtDate;
    WORD LstAccDate;
    WORD FstClusHI;
    WORD WrtTime;
    WORD WrtDate;
    WORD FstClusLO;
    DWORD FileSize;
} DIR_ENTRY;
#pragma pack(pop)

//
// Variables
//
static EFI_RAM_DISK_PROTOCOL* gspRamDiskProtocol = NULL;

//
// Prototypes
//
static EFI_STATUS EFIAPI RamdiskLocateProtocol(VOID);
static DWORD GetFATSizeSectors(DWORD DskSize,
